In [31]:
from pandas import Series, DataFrame
import pandas as pd
import numpy as np

In [2]:
se = Series([1.1,3,5,-1])
se

0    1.1
1    3.0
2    5.0
3   -1.0
dtype: float64

In [5]:
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj4 = Series(sdata, index=['California', 'Ohio', 'Oregon', 'Texas'])
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [7]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [10]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year':[2000,2001,2002,2001,2001],
        'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data, columns=['year','state','pop'])
frame

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2001  Nevada  2.9

In [22]:
frame.loc[1]

year     2001
state    Ohio
pop       1.7
Name: 1, dtype: object

In [29]:
frame.ix??

In [28]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index[:2]

Index(['a', 'b'], dtype='object')

In [33]:
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a', 'c', 'd'], columns=['Ohio', 'Texas', 'California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [45]:
f2 = frame.reindex(['a', 'b', 'c', 'd'], method='ffill')
f3 = frame.loc[['a', 'b', 'c', 'd'], ['Texas', 'Utah', 'California']]
f3

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [49]:
f3.drop('Utah',axis=1)

   Texas  California
a    1.0         2.0
b    NaN         NaN
c    4.0         5.0
d    7.0         8.0

In [54]:
frame = DataFrame(np.arange(16).reshape(4,4), index=['Ohio','Colorado','Utah','Oregon'], columns=['one','two','three','four'])
frame[['two', 'one']]

          two  one
Ohio        1    0
Colorado    5    4
Utah        9    8
Oregon     13   12

In [55]:
frame < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
Oregon    False  False  False  False

In [56]:
s1 = Series([1.2,3.4,-.4,4], index=['a','c','d','e'])
s2 = Series([1,2,3,4,5], index=['a','c','e','f','g'])

In [59]:
s1 + s2

a    2.2
c    5.4
d    NaN
e    7.0
f    NaN
g    NaN
dtype: float64

In [73]:
import pickle
with open('d:/pydata-book/ch05/yahoo_price.pkl', 'rb') as f:
    pickle.loads(f)

TypeError: a bytes-like object is required, not '_io.BufferedReader'